Revit 2027 API
ColumnAttachment.RemoveColumnAttachment(FamilyInstance, Int32) Method
 Removes an attachment at the top or base of a column, if there is one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveColumnAttachment(
	FamilyInstance column,
	int baseOrTop
)
Public Shared Sub RemoveColumnAttachment (
	column As FamilyInstance,
	baseOrTop As Integer
)
public:
static void RemoveColumnAttachment(
	FamilyInstance^ column,
	int baseOrTop
)
static member RemoveColumnAttachment :
        column : FamilyInstance *
        baseOrTop : int -> unit
Parameters
column FamilyInstance
 A column.
baseOrTop Int32
 0 for base, 1 for top.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  baseOrTop must be either 0 or 1.
Remarks
 This method modifies both column and target elements.
See Also
Reference
ColumnAttachment Class
RemoveColumnAttachment Overload
Autodesk.Revit.DB Namespace